tutorials/compressible/realFluidPisoFoam/ras/backStep_IAPWS97/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libcompressibleRASModels.so"
)

application     realFluidPisoFoam;

startFrom       latestTime;

//startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          1e-5;

writeControl    runTime;

writeInterval  1e-1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

adjustTimeStep  yes;

maxCo          0.75;

maxDeltaT       0.01;

runTimeModifiable yes;


// ************************************************************************* //
